espressif/esp-idf/components/soc/esp32c3/include/soc/sens_reg.h
#define SENS_SAR_HALL_CTRL_REG          (DR_REG_SENS_BASE + 0x013c)
/* SENS_HALL_PHASE_FORCE : R/W ;bitpos:[31] ;default: 1'b1 ; */
/*description: 1: HALL PHASE is controlled by SW  0: HALL PHASE is controlled
 by FSM in ULP-coprocessor*/
#define SENS_HALL_PHASE_FORCE  (BIT(31))
#define SENS_HALL_PHASE_FORCE_M  (BIT(31))
#define SENS_HALL_PHASE_FORCE_V  0x1
#define SENS_HALL_PHASE_FORCE_S  31
/* SENS_HALL_PHASE : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: Reverse phase of hall sensor*/
#define SENS_HALL_PHASE  (BIT(30))
#define SENS_HALL_PHASE_M  (BIT(30))
#define SENS_HALL_PHASE_V  0x1
#define SENS_HALL_PHASE_S  30
/* SENS_XPD_HALL_FORCE : R/W ;bitpos:[29] ;default: 1'b1 ; */
/*description: 1: XPD HALL is controlled by SW. 0: XPD HALL is controlled by
 FSM in ULP-coprocessor*/
#define SENS_XPD_HALL_FORCE  (BIT(29))
#define SENS_XPD_HALL_FORCE_M  (BIT(29))
#define SENS_XPD_HALL_FORCE_V  0x1
#define SENS_XPD_HALL_FORCE_S  29
/* SENS_XPD_HALL : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: Power on hall sensor and connect to VP and VN*/
#define SENS_XPD_HALL  (BIT(28))
#define SENS_XPD_HALL_M  (BIT(28))
#define SENS_XPD_HALL_V  0x1
#define SENS_XPD_HALL_S  28

#define SENS_SAR_NOUSE_REG          (DR_REG_SENS_BASE + 0x0140)
/* SENS_SAR_NOUSE : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SENS_SAR_NOUSE  0xFFFFFFFF
#define SENS_SAR_NOUSE_M  ((SENS_SAR_NOUSE_V)<<(SENS_SAR_NOUSE_S))
#define SENS_SAR_NOUSE_V  0xFFFFFFFF
#define SENS_SAR_NOUSE_S  0

#define SENS_SAR_PERI_CLK_GATE_CONF_REG          (DR_REG_SENS_BASE + 0x0144)
/* SENS_IOMUX_CLK_EN : R/W ;bitpos:[31] ;default: 1'd0 ; */
/*description: */
#define SENS_IOMUX_CLK_EN  (BIT(31))
#define SENS_IOMUX_CLK_EN_M  (BIT(31))
#define SENS_IOMUX_CLK_EN_V  0x1
#define SENS_IOMUX_CLK_EN_S  31
/* SENS_CLK_EN : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SENS_CLK_EN  (BIT(30))
#define SENS_CLK_EN_M  (BIT(30))
#define SENS_CLK_EN_V  0x1
#define SENS_CLK_EN_S  30
/* SENS_TSENS_CLK_EN : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SENS_TSENS_CLK_EN  (BIT(29))
#define SENS_TSENS_CLK_EN_M  (BIT(29))
#define SENS_TSENS_CLK_EN_V  0x1
#define SENS_TSENS_CLK_EN_S  29
/* SENS_RTC_I2C_CLK_EN : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SENS_RTC_I2C_CLK_EN  (BIT(27))
#define SENS_RTC_I2C_CLK_EN_M  (BIT(27))
#define SENS_RTC_I2C_CLK_EN_V  0x1
#define SENS_RTC_I2C_CLK_EN_S  27
/* SENS_DAC_CLK_EN : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SENS_DAC_CLK_EN  (BIT(26))
#define SENS_DAC_CLK_EN_M  (BIT(26))
#define SENS_DAC_CLK_EN_V  0x1
#define SENS_DAC_CLK_EN_S  26

#define SENS_SAR_PERI_RESET_CONF_REG          (DR_REG_SENS_BASE + 0x0148)
/* SENS_RESET : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SENS_RESET  (BIT(30))
#define SENS_RESET_M  (BIT(30))
#define SENS_RESET_V  0x1
#define SENS_RESET_S  30
/* SENS_TSENS_RESET : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SENS_TSENS_RESET  (BIT(29))
#define SENS_TSENS_RESET_M  (BIT(29))
#define SENS_TSENS_RESET_V  0x1
#define SENS_TSENS_RESET_S  29
#define SENS_FORCE_XPD_SAR_SW_M (BIT1)
#define SENS_FORCE_XPD_SAR_FSM 0 // Use FSM to control power down
#define SENS_FORCE_XPD_SAR_PD  2 // Force power down
#define SENS_FORCE_XPD_SAR_PU  3 // Force power up
/* SENS_RTC_I2C_RESET : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: */
#define SENS_RTC_I2C_RESET  (BIT(27))
#define SENS_RTC_I2C_RESET_M  (BIT(27))
#define SENS_RTC_I2C_RESET_V  0x1
#define SENS_RTC_I2C_RESET_S  27
/* SENS_DAC_RESET : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: */
#define SENS_DAC_RESET  (BIT(26))
#define SENS_DAC_RESET_M  (BIT(26))
#define SENS_DAC_RESET_V  0x1
#define SENS_DAC_RESET_S  26
/* SENS_COCPU_RESET : R/W ;bitpos:[25] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_RESET  (BIT(25))
#define SENS_COCPU_RESET_M  (BIT(25))
#define SENS_COCPU_RESET_V  0x1
#define SENS_COCPU_RESET_S  25

#define SENS_SAR_COCPU_INT_ENA_W1TS_REG          (DR_REG_SENS_BASE + 0x014c)
/* SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_M  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TS_S  11
/* SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_M  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TS_S  10
/* SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_M  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TS_S  9
/* SENS_COCPU_SWD_INT_ENA_W1TS : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SWD_INT_ENA_W1TS  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TS_M  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SWD_INT_ENA_W1TS_S  8
/* SENS_COCPU_SW_INT_ENA_W1TS : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SW_INT_ENA_W1TS  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TS_M  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SW_INT_ENA_W1TS_S  7
/* SENS_COCPU_START_INT_ENA_W1TS : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_START_INT_ENA_W1TS  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TS_M  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_START_INT_ENA_W1TS_S  6
/* SENS_COCPU_TSENS_INT_ENA_W1TS : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TSENS_INT_ENA_W1TS  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TS_M  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TSENS_INT_ENA_W1TS_S  5
/* SENS_COCPU_SENS2_INT_ENA_W1TS : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SENS2_INT_ENA_W1TS  (BIT(4))
#define SENS_COCPU_SENS2_INT_ENA_W1TS_M  (BIT(4))
#define SENS_COCPU_SENS2_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SENS2_INT_ENA_W1TS_S  4
/* SENS_COCPU_SENS1_INT_ENA_W1TS : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SENS1_INT_ENA_W1TS  (BIT(3))
#define SENS_COCPU_SENS1_INT_ENA_W1TS_M  (BIT(3))
#define SENS_COCPU_SENS1_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_SENS1_INT_ENA_W1TS_S  3
/* SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_M  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TS_S  2
/* SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_M  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TS_S  1
/* SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_M  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_V  0x1
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TS_S  0

