espressif/esp-idf/components/soc/esp32c3/include/soc/sens_reg.h
#define SENS_SAR_COCPU_INT_ENA_W1TC_REG          (DR_REG_SENS_BASE + 0x0150)
/* SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_M  (BIT(11))
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_SCAN_DONE_INT_ENA_W1TC_S  11
/* SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_M  (BIT(10))
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_APPROACH_LOOP_DONE_INT_ENA_W1TC_S  10
/* SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_M  (BIT(9))
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_TIMEOUT_INT_ENA_W1TC_S  9
/* SENS_COCPU_SWD_INT_ENA_W1TC : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SWD_INT_ENA_W1TC  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TC_M  (BIT(8))
#define SENS_COCPU_SWD_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SWD_INT_ENA_W1TC_S  8
/* SENS_COCPU_SW_INT_ENA_W1TC : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SW_INT_ENA_W1TC  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TC_M  (BIT(7))
#define SENS_COCPU_SW_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SW_INT_ENA_W1TC_S  7
/* SENS_COCPU_START_INT_ENA_W1TC : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_START_INT_ENA_W1TC  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TC_M  (BIT(6))
#define SENS_COCPU_START_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_START_INT_ENA_W1TC_S  6
/* SENS_COCPU_TSENS_INT_ENA_W1TC : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TSENS_INT_ENA_W1TC  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TC_M  (BIT(5))
#define SENS_COCPU_TSENS_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TSENS_INT_ENA_W1TC_S  5
/* SENS_COCPU_SENS2_INT_ENA_W1TC : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SENS2_INT_ENA_W1TC  (BIT(4))
#define SENS_COCPU_SENS2_INT_ENA_W1TC_M  (BIT(4))
#define SENS_COCPU_SENS2_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SENS2_INT_ENA_W1TC_S  4
/* SENS_COCPU_SENS1_INT_ENA_W1TC : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_SENS1_INT_ENA_W1TC  (BIT(3))
#define SENS_COCPU_SENS1_INT_ENA_W1TC_M  (BIT(3))
#define SENS_COCPU_SENS1_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_SENS1_INT_ENA_W1TC_S  3
/* SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_M  (BIT(2))
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_ACTIVE_INT_ENA_W1TC_S  2
/* SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_M  (BIT(1))
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_INACTIVE_INT_ENA_W1TC_S  1
/* SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_M  (BIT(0))
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_V  0x1
#define SENS_COCPU_TOUCH_DONE_INT_ENA_W1TC_S  0

#define SENS_SARDATE_REG          (DR_REG_SENS_BASE + 0x0154)
/* SENS_SAR_DATE : R/W ;bitpos:[27:0] ;default: 28'h1909160 ; */
/*description: */
#define SENS_SAR_DATE  0x0FFFFFFF
#define SENS_SAR_DATE_M  ((SENS_SAR_DATE_V)<<(SENS_SAR_DATE_S))
#define SENS_SAR_DATE_V  0xFFFFFFF
#define SENS_SAR_DATE_S  0

#ifdef __cplusplus
}
#endif



#endif /*_SOC_SENS_REG_H_ */
